[
  {
    "joke": "Teacher: What is the full form of maths? Student: Mind Activation Through Hardwork and Study.",
    "emotion": "dumb"
  },
  {
    "joke": "Pappu: Why are you talking to your shoes? Raju: I’m having a sole conversation!",
    "emotion": "dumb"
  },
  {
    "joke": "Why don’t scientists trust atoms? Because they make up everything!",
    "emotion": "happy"
  },
  {
    "joke": "Doctor: You need exercise. Me: Can’t. My fitbit battery is dead.",
    "emotion": "neutral"
  },
  {
    "joke": "Life is short. Smile while you still have teeth!",
    "emotion": "happy"
  },
  {
    "joke": "Why did the computer go to the doctor? Because it had a virus!",
    "emotion": "neutral"
  },
  {
    "joke": "Boy: Dad, I got 95 in my exam! Dad: Very good, out of? Boy: Out of 100 people in class.",
    "emotion": "dumb"
  },
  {
    "joke": "Why did the tomato turn red?\nBecause it saw the salad dressing! 🥗😳😂",
    "emotion": "dumb"
  },
  {
    "joke": "Why don’t skeletons fight each other? Because they don’t have the guts.",
    "emotion": "happy"
  },
  {
    "joke": "I told my computer I needed a break, and now it won’t stop sending me KitKat ads.",
    "emotion": "dumb"
  },
  {
    "joke": "Mom: Why are your marks so low? Me: Because I sit at the back and I can’t see the future.",
    "emotion": "dumb"
  },
  {
    "joke": "If Monday had a face, I would punch it.",
    "emotion": "angry"
  },
  {
    "joke": "I opened the fridge and saw a piece of cake. The cake said: 'Don't do it'. I did it anyway.",
    "emotion": "neutral"
  },
  {
    "joke": "Teacher: Give an example of a business failure. Me: My dad’s barber shop... he's bald now.",
    "emotion": "dumb"
  },
  {
    "joke": "Why did the scarecrow win an award? Because he was outstanding in his field.",
    "emotion": "happy"
  },
  {
    "joke": "Google knows everything except where I left my charger.",
    "emotion": "neutral"
  },
  {
    "joke": "Life is all about balance. For example, I had samosa for lunch... and guilt for dinner.",
    "emotion": "happy"
  },
  {
    "joke": "I asked my dog what's two minus two. He said nothing. Correct!",
    "emotion": "dumb"
  },
  {
    "joke": "My brain: Let's be productive! Also my brain: Did dinosaurs yawn?",
    "emotion": "dumb"
  },
  {
    "joke": "I wasn’t late, the world was early.",
    "emotion": "dumb"
  },
  {
    "joke": "I downloaded a fitness app. It keeps sending me sad emojis.",
    "emotion": "sad"
  },
  {
    "joke": "I tried cooking today. The fire alarm said it tasted smoky.",
    "emotion": "dumb"
  },
  {
    "joke": "Google: You mean ‘responsible adult’? Me: No, I meant chocolate cake.",
    "emotion": "happy"
  },
  {
    "joke": "Friend: You’re overthinking again. Me: I know, I even overthink my sleep schedule.",
    "emotion": "neutral"
  },
  {
    "joke": "I told my parents I’m emotionally mature. Then I cried over burnt toast.",
    "emotion": "dumb"
  },
  {
    "joke": "Dad: Why don’t you go out and socialize? Me: I did. With my fan. It listened.",
    "emotion": "sad"
  },
  {
    "joke": "My life is like Wi-Fi — great signal until guests arrive.",
    "emotion": "angry"
  },
  {
    "joke": "Sometimes I laugh at my own jokes... so I don’t feel alone.",
    "emotion": "happy"
  },
  {
    "joke": "I told my crush I like her. Now I like peace and quiet.",
    "emotion": "dumb"
  },
  {
    "joke": "My bank account is like a coconut. Hard outside, empty inside.",
    "emotion": "sad"
  },
  {
    "joke": "They said dress for the job you want. I showed up in pajamas.",
    "emotion": "dumb"
  },
  {
    "joke": "I asked the mirror who’s the smartest. It shut itself off.",
    "emotion": "angry"
  },
  {
    "joke": "Teacher: Any doubts? Me: Yeah, in life.",
    "emotion": "neutral"
  },
  {
    "joke": "When I said I’m ‘built different’, I meant I forget everything in 3 seconds.",
    "emotion": "dumb"
  },
  {
    "joke": "They said talk like a CEO. I said ‘chai lao’ confidently.",
    "emotion": "funny"
  },
  {
    "joke": "I tried meditation. Slept for 3 hours. Felt spiritual.",
    "emotion": "happy"
  },
  {
    "joke": "Mom: Why are you single? Me: Because my crush has taste.",
    "emotion": "sad"
  },
  {
    "joke": "Every morning I wake up with energy. Then I remember I have responsibilities.",
    "emotion": "sad"
  },
  {
    "joke": "I joined the gym last week. The trainer hasn’t recovered yet.",
    "emotion": "dumb"
  },
  {
    "joke": "My brain said 'focus'. My phone said 'reels'. Guess who won?",
    "emotion": "funny"
  },
  {
    "joke": "Job interview: ‘Where do you see yourself in 5 years?’ Me: ‘In your chair.’",
    "emotion": "bold"
  },
  {
    "joke": "If laziness was an Olympic sport, I’d still not show up.",
    "emotion": "neutral"
  },
  {
    "joke": "Crush: I like confident guys. Me: I think... maybe... possibly... I could be that?",
    "emotion": "sad"
  },
  {
    "joke": "Friend: Don’t overthink. Me: Okay. *starts overthinking why I overthink*",
    "emotion": "dumb"
  },
  {
    "joke": "Woke up, opened WhatsApp, saw 0 messages. Slept again.",
    "emotion": "sad"
  },
  {
    "joke": "Me: I have plans this weekend. Reality: Pajamas. Blanket. Zero movement.",
    "emotion": "neutral"
  },
  {
    "joke": "My boss said dress for success. I wore my lucky t-shirt from 2010.",
    "emotion": "funny"
  },
  {
    "joke": "Phone battery 5%. Me: Let me watch one last 2-hour documentary.",
    "emotion": "dumb"
  }
]


